espressif/esp-idf/components/soc/esp32s31/register/soc/ppa_struct.h
/** Type of blend_fix_pixel register
 *  Blending engine fix pixel register
 */
typedef union {
    struct {
        /** blend_tx_fix_pixel : R/W; bitpos: [31:0]; default: 0;
         *  The configure fix pixel in fix pixel filling mode for blender engine.
         */
        uint32_t blend_tx_fix_pixel:32;
    };
    uint32_t val;
} ppa_blend_fix_pixel_reg_t;

/** Type of ck_fg_low register
 *  foreground color key lower threshold
 */
typedef union {
    struct {
        /** colorkey_fg_b_low : R/W; bitpos: [7:0]; default: 255;
         *  color key lower threshold of foreground b channel
         */
        uint32_t colorkey_fg_b_low:8;
        /** colorkey_fg_g_low : R/W; bitpos: [15:8]; default: 255;
         *  color key lower threshold of foreground g channel
         */
        uint32_t colorkey_fg_g_low:8;
        /** colorkey_fg_r_low : R/W; bitpos: [23:16]; default: 255;
         *  color key lower threshold of foreground r channel
         */
        uint32_t colorkey_fg_r_low:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} ppa_ck_fg_low_reg_t;

/** Type of ck_fg_high register
 *  foreground color key higher threshold
 */
typedef union {
    struct {
        /** colorkey_fg_b_high : R/W; bitpos: [7:0]; default: 0;
         *  color key higher threshold of foreground b channel
         */
        uint32_t colorkey_fg_b_high:8;
        /** colorkey_fg_g_high : R/W; bitpos: [15:8]; default: 0;
         *  color key higher threshold of foreground g channel
         */
        uint32_t colorkey_fg_g_high:8;
        /** colorkey_fg_r_high : R/W; bitpos: [23:16]; default: 0;
         *  color key higher threshold of foreground r channel
         */
        uint32_t colorkey_fg_r_high:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} ppa_ck_fg_high_reg_t;

/** Type of ck_bg_low register
 *  background color key lower threshold
 */
typedef union {
    struct {
        /** colorkey_bg_b_low : R/W; bitpos: [7:0]; default: 255;
         *  color key lower threshold of background b channel
         */
        uint32_t colorkey_bg_b_low:8;
        /** colorkey_bg_g_low : R/W; bitpos: [15:8]; default: 255;
         *  color key lower threshold of background g channel
         */
        uint32_t colorkey_bg_g_low:8;
        /** colorkey_bg_r_low : R/W; bitpos: [23:16]; default: 255;
         *  color key lower threshold of background r channel
         */
        uint32_t colorkey_bg_r_low:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} ppa_ck_bg_low_reg_t;

/** Type of ck_bg_high register
 *  background color key higher threshold
 */
typedef union {
    struct {
        /** colorkey_bg_b_high : R/W; bitpos: [7:0]; default: 0;
         *  color key higher threshold of background b channel
         */
        uint32_t colorkey_bg_b_high:8;
        /** colorkey_bg_g_high : R/W; bitpos: [15:8]; default: 0;
         *  color key higher threshold of background g channel
         */
        uint32_t colorkey_bg_g_high:8;
        /** colorkey_bg_r_high : R/W; bitpos: [23:16]; default: 0;
         *  color key higher threshold of background r channel
         */
        uint32_t colorkey_bg_r_high:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} ppa_ck_bg_high_reg_t;

/** Type of ck_default register
 *  default value when foreground and background both in color key range
 */
typedef union {
    struct {
        /** colorkey_default_b : R/W; bitpos: [7:0]; default: 0;
         *  default B channel value of color key
         */
        uint32_t colorkey_default_b:8;
        /** colorkey_default_g : R/W; bitpos: [15:8]; default: 0;
         *  default G channel value of color key
         */
        uint32_t colorkey_default_g:8;
        /** colorkey_default_r : R/W; bitpos: [23:16]; default: 0;
         *  default R channel value of color key
         */
        uint32_t colorkey_default_r:8;
        /** colorkey_fg_bg_reverse : R/W; bitpos: [24]; default: 0;
         *  when pixel in bg ck range but not in fg ck range, 0: the result is bg, 1: the
         *  result is fg
         */
        uint32_t colorkey_fg_bg_reverse:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} ppa_ck_default_reg_t;

/** Type of srm_scal_rotate register
 *  Scaling and rotating coefficient register
 */
typedef union {
    struct {
        /** srm_scal_x_int : R/W; bitpos: [7:0]; default: 1;
         *  The integrated part of scaling coefficient in X direction.
         */
        uint32_t srm_scal_x_int:8;
        /** srm_scal_x_frag : R/W; bitpos: [11:8]; default: 0;
         *  The fragment part of scaling coefficient in X direction.
         */
        uint32_t srm_scal_x_frag:4;
        /** srm_scal_y_int : R/W; bitpos: [19:12]; default: 1;
         *  The integrated part of scaling coefficient in Y direction.
         */
        uint32_t srm_scal_y_int:8;
        /** srm_scal_y_frag : R/W; bitpos: [23:20]; default: 0;
         *  The fragment part of scaling coefficient in Y direction.
         */
        uint32_t srm_scal_y_frag:4;
        /** srm_rotate_angle : R/W; bitpos: [25:24]; default: 0;
         *  The rotate angle. 0: 0 degree. 1: 90 degree. 2: 180 degree. 3: 270 degree.
         */
        uint32_t srm_rotate_angle:2;
        /** scal_rotate_rst : R/W; bitpos: [26]; default: 0;
         *  Write 1 then write 0 to this bit to reset scaling and rotating engine.
         */
        uint32_t scal_rotate_rst:1;
        /** scal_rotate_start : WT; bitpos: [27]; default: 0;
         *  Write 1 to enable scaling and rotating engine after parameter is configured.
         */
        uint32_t scal_rotate_start:1;
        /** srm_mirror_x : R/W; bitpos: [28]; default: 0;
         *  Image mirror in X direction. 0: disable, 1: enable
         */
        uint32_t srm_mirror_x:1;
        /** srm_mirror_y : R/W; bitpos: [29]; default: 0;
         *  Image mirror in Y direction. 0: disable, 1: enable
         */
        uint32_t srm_mirror_y:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} ppa_srm_scal_rotate_reg_t;

/** Type of srm_mem_pd register
 *  SR memory power done register
 */
typedef union {
    struct {
        /** srm_mem_clk_ena : R/W; bitpos: [0]; default: 0;
         *  Set this bit to force clock enable of scaling and rotating engine's data memory.
         */
        uint32_t srm_mem_clk_ena:1;
        /** srm_mem_force_pd : R/W; bitpos: [1]; default: 0;
         *  Set this bit to force power down scaling and rotating engine's data memory.
         */
        uint32_t srm_mem_force_pd:1;
        /** srm_mem_force_pu : R/W; bitpos: [2]; default: 0;
         *  Set this bit to force power up scaling and rotating engine's data memory.
         */
        uint32_t srm_mem_force_pu:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} ppa_srm_mem_pd_reg_t;

/** Type of reg_conf register
 *  Register clock enable register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  PPA register clock gate enable signal.
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ppa_reg_conf_reg_t;

